// 長崎県 の問題データ
const nagasakiQuestions = [
  {
    q: "長崎県の県庁所在地は？",
    choices: [
      "佐世保市",
      "諫早市",
      "長崎市",
    ],
    a: "長崎市",
    memo: "長崎県の県庁所在地は長崎市です。"
  },
  {
    q: "1945年に原子爆弾が投下された長崎県の都市は？",
    choices: [
      "長崎市",
      "佐世保市",
      "広島市",
    ],
    a: "長崎市",
    memo: "長崎市は広島市と共に原爆が投下された都市です。"
  },
  {
    q: "長崎県にあるオランダの街並みを再現したテーマパークは？",
    choices: [
      "ユニバーサル・スタジオ・ジャパン",
      "ハウステンボス",
      "東京ディズニーランド",
    ],
    a: "ハウステンボス",
    memo: "ハウステンボスは長崎県にあるオランダをテーマにしたテーマパークです。"
  },
  {
    q: "日本一島の数が多い都道府県は？",
    choices: [
      "長崎県",
      "沖縄県",
      "鹿児島県",
    ],
    a: "長崎県",
    memo: "長崎県は島の数が日本で一番多い都道府県です。"
  },
  {
    q: "長崎県の名物麺料理は？",
    choices: [
      "ちゃんぽん",
      "博多ラーメン",
      "讃岐うどん",
    ],
    a: "ちゃんぽん",
    memo: "ちゃんぽんは長崎県の名物料理です。"
  },
  {
    q: "江戸時代に鎖国中も海外との窓口だった長崎県の人工島は？",
    choices: [
      "隠岐諸島",
      "小笠原諸島",
      "出島",
    ],
    a: "出島",
    memo: "出島は江戸時代に海外との貿易窓口だった人工島です。"
  },
];